# GetChangedSharedParameterGUIDs Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetChangedSharedParameterGUIDs Method
RebarUpdateCurvesData Class See Also
---
Returns an array containing the shared parameter GUIDs that were changed since the last regeneration. Array is empty if no shared params were changed since the last regeneration.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public IList<Guid> GetChangedSharedParameterGUIDs()
```

Visual Basic
---
```text
Public Function GetChangedSharedParameterGUIDs As IList(Of Guid)
```

Visual C++
---
```text
public:
IList<Guid>^ GetChangedSharedParameterGUIDs()
```

# ### Return Value
Returns an array containing the elementId of the shared params that were changed since the last regeneration.
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace